var ball=0;

var otv= prompt("Питання 1: Скільки тижднів у році? ");
if(otv=="52") {ball++;}

var otv= prompt("Питання 2: Скільки сантиметрів у метрі?");
if(otv=="100") {ball++;}


var otv= prompt("Питання 3: Як перекладається слово 'Dog?' ");
if(otv=="собака") {ball++;}


var otv= prompt("Питання 4: Яка тварина хрюкає? ");
if(otv=="свиня") {ball++;}
else;

var otv= prompt("Питання 5: Який колір вийде якщо змішати синій та жовтий? ");
if(otv=="зелений") {ball++;}
else;

var otv= prompt("Питання 6: 3 якого віку дозволено купувати алкоголь? ");
if(otv=="21") {ball++;}
else;

var otv= prompt("Питання 7: Скільки материків на Землі? ");
if(otv=="6") {ball++;}
else;

var otv= prompt("Питання 8: Яке число пропущене в наступній послідовності? 84, 81, 59, 107, 34,___, 9, 159, -16, 185? ");
if(otv=="133") {ball++;}
else;

var otv= prompt("Питання 9: Скільки пальців на руці? ");
if(otv=="5") {ball++;}
else;

var otv= prompt("Питання 10:Скільки місяців має 28 днів? ");
if(otv=="12") {ball++;}
else;
 

alert("Ваш результат: "+ball+" балів");
